import uk from 'vuetify/lib/locale/uk';

export default {
  ...uk,
  locale: {
    switcherLabel: 'Виберіть мову'
  },
  terms: 'Угода Користувача',
  privacyPolicy: 'Політика конфіденційності',
  auth: {
    emailLabel: 'Електронна пошта',
    secretLabel: 'Пароль',
    confirmSecretLabel: 'Підтвердження пароля',
    namesLabel: {
      first: 'Ім\'я',
      last: 'Прізвище'
    },
    socialDelimiter: 'або',
    validate: {
      required: 'Поле обов\'язкове!',
      termsAndPolicy: 'Потрібно прийняти умови та політику конфіденційності',
      format: {
        email: 'Помилковий формат електронної пошти',
        secret: 'Помилковий формат пароля: повинен містити від 6 до 14 символів, принаймні 1 літеру верхнього регістру та 1 цифру',
        confirmSecret: 'Пароль і підтвердження пароля не збігаються',
        names: 'Ім\'я має бути більше ніж 3 і менше ніж 15 символів. Містить лише літери'
      },
    },
    login: {
      title: 'Авторизацiя',
      subtitle: 'Увійдіть у свій обліковий запис',
      forgotPassLink: 'Забули пароль?',
      formButton: 'УВІЙТИ',
      registerQuestion: 'Вперше на нашій платформі?',
      registerLink: 'Створити обліковий запис',
    },
    register: {
      title: 'Вітаємо у SmartDesk!',
      subtitle: 'Зробіть керування вашим додатком легким і цікавим!',
      terms: 'Погоджуюсь з умовами i полiтикою конфiденцiйностi',
      formButton: 'РЕЄСТРАЦІЯ',
      loginQuestion: 'Уже маєте обліковий запис?',
      loginLink: 'Авторизуватись'
    },
    registerComplete: {
      title: 'Завершення реєстрації',
      subtitle: 'Майже готово :) Створіть свій пароль',
      submitBtn: 'Завершити',
      loaderTitle: 'Перевірка токену доступу. Будь ласка, зачекайте...'
    },
    passwordReset: {
      title: 'Відновлення пароля',
      subtitle: 'Вкажіть свій Email і ми надішлемо вам новий пароль',
      cancelBtn: 'Скасувати',
      submitBtn: 'Відновити'
    },
    passwordChange: {
      title: 'Зміна пароля',
      subtitle: 'Створіть свій пароль',
      submitBtn: 'Зберегти',
      loaderTitle: 'Перевірка токену доступу. Будь ласка, зачекайте...'
    }
  },
  error: {
    title: 'Сторінку не знайдено',
    subtitle: 'ми не змогли знайти сторінку, яку ви шукаєте',
    btnText: 'домашня сторінка'
  },
  sessionExpired: 'Поточний сеанс закінчився',
  pageTitles: {
    landing: 'SmartDesk |> Конструктор ботів месенджерів',
    error: 'SmartDesk |> Сторінка помилок',
    app: {
      login: 'SmartDesk |> Авторизацiя',
      register: 'SmartDesk |> Реєстрація',
      registerComplete: 'SmartDesk |> Завершення реєстрації',
      passwordReset: 'SmartDesk |> Відновлення паролю',
      passwordCreate: 'SmartDesk |> Створити пароль',
      dashboard: 'SmartDesk |> Iнформаційна панель',
    },
    admin: {}
  },
  landing: {
    header: {
      links: {
        advantages: 'Можливості',
        solutions: 'Інструменти',
        prices: 'Ціни',
        login: 'Увійти',
        register: 'Реєстрація'
      }
    },
    footer: {
      copyright: 'Усі права захищено',
      privacyPolicy: 'Політика конфіденційності',
      terms: 'Угода користувача',
    },
    welcomeBlock: {
      title: 'Розумний конструктор ботів для месенджерів: <br> <b>Telegram</b>, <b>Viber</b>, <b>Facebook</b>',
      subtitle: 'Створюйте ботів будь-якої складності для популярних месенджерів <b class="text-decoration-underline">без програмування</b>',
      button: 'Спробувати безкоштовно'
    },
    descriptionBlock: {
      chatbot: {
        title: 'Що таке чат-бот?',
        text: '<b>Чат-бот</b>— це невеликий мобільний додаток в месенджері.<br>Ви можете використовувати його як додатковий канал або повністю замінити ним мобільний додаток. Немає необхідності в установці.<br>Якщо у вашого клієнта вже є месенджер, він може знайти вашого бота і почати використовувати його прямо зараз.'
      },
      opportunity: {
        title: 'Можливості чат-ботів',
        subtitle: 'Практично безмежні: від навігації по товарах/послугах до повної автоматизації вашого бізнесу.',
        automation: {
          title: 'Автоматизація',
          text: 'Створіть нові канали продажу та обслуговуйте ваших клієнтів без залучення додаткових людей. <br> Робот сам проведе клієнта за необхідними кроками.'
        },
        support: {
          title: 'Підтримка',
          text: 'Легко організуйте підтримку клієнтів у чаті, з хелпдеск інструментами.'
        },
        sales: {
          title: 'Продажі',
          text: 'Продавайте найпопулярніші товари в кілька кліків.'
        },
        communication: {
          title: 'Спілкування',
          text: 'Спілкуйтеся зі своїми клієнтами там, де їм це зручно.'
        },
        marketing: {
          title: 'Маркетинг',
          text: 'Швидко перевіряйте свої гіпотези.'
        },
        efficiency: {
          title: 'Ефективність',
          text: 'Створюйте потужні інструменти та програми для вашого бізнесу та офісу.'
        },
      }
    },
    advantagesBlock: {
      title: 'Розумний бот для всіх месенджерів',
      subtitle: 'Напишіть бота 1 раз і легко інтегруйте зі всіма популярними месенджерами'
    },
    solutionsBlock: {
      title: 'Всі необхідні інструменти',
      subtitle: 'Для створення функціонального чат-боту та месенджер-маркетингу',
      visualRedactor: {
        title: 'Зберіть чат-бота у візуальному редакторі',
        text: 'Не потрібно знати програмування, щоб створити робота в SmartDesk. Придумайте сценарій роботи бота, виберіть потрібні компоненти та зв\'яжіть їх між собою у візуальному редакторі.'
      },
      chatCommunicate: {
        title: 'Спілкуйтеся з клієнтами в чаті',
        text: 'Утримуйте клієнтів, навіть якщо бот не впорався. Дізнайтеся вчасно про помилки та обробляйте всі звернення. А ще завжди можна переглянути історію спілкування людини з ботом. <br><br> Підключіть свого співробітника до спілкування з бот-клієнтом - щоб ви не втратили клієнта і не допустили негативу, якщо бот нічого не зрозумів.'
      },
      gatherStatistics: {
        title: 'Збирайте статистику',
        text: 'Приймайте рішення на основі чисел. Розділ статистики надасть корисну інформацію про користувачів. Ви завжди зможете відстежити, на якому етапі губляться користувачі, та покращити бота. Так ви не витратите рекламний бюджет марно.'
      },
      segmentUsers: {
        title: 'Сегментуйте користувачів та надсилайте розсилки',
        text: 'Не чекайте, поки користувач знову напише боту - надішліть йому новини та пропозиції. Групуйте користувачів мітками і надсилайте тільки цікавий контент.'
      },
    },
    pricingBlock: {
      title: 'Тарифні плани',
      subtitle: 'Виберіть найбільш оптимальний план, що відповідає вашим потребам.',
      paymentPeriodTitle: 'Виберіть період оплати. <br> <div class="d-flex flex-row justify-center text-decoration-underline" style="font-size: 14px"><b>P.S. Річний платіж на 20% дешевше</b></div>',
      paymentPeriodYear: 'Рік',
      paymentPeriodMonth: 'Місяць',
      selectBots: 'Виберіть месенджери, які братимуть участь у проекті',
      plans: {
        features: {
          demoBotsTitle: 'Кількість демо ботів',
          realBotsTitle: 'Кількість production ботів',
          botsConstructor: 'Графічний конструктор',
          botsAnalytics: 'Розділ "Аналітики"',
          customersMailing: 'Розсилка клієнтам',
          accessTransfer: 'Передача доступу до бота',
          employeesAccess: 'Доступ співробітників',
          crmIntegrations: 'CRM Integrations'
        },
        selectButton: 'Вибрати план',
        padawan: {
          title: 'Падаван',
          description: 'Тариф для початківців'
        },
        jedi: {
          title: 'Джедай',
          description: 'Тариф для впевнених'
        },
        yoda: {
          title: 'Майстер Йода',
          description: 'Тариф для професіоналів'
        }
      },
      newbieOffer: {
        title: 'Не можете визначитися з тарифом?',
        description: 'Виберіть безкоштовний план для створення необмеженої кількості демо-ботів. <br> Цей план найркащий варiант для створення ботів на презентацію або вашого навчання :)',
        button: 'Спробувати безкоштовно'
      }
    }
  }
}
