<template>
  <v-dialog v-model="isVisible" scrollable width="auto">
    <v-card>
      <v-card-title>
        <v-tabs v-model="currentTab" icons-and-text grow>
          <v-tab>
            {{ $vuetify.lang.t('$vuetify.terms') }}

            <i class="far fa-lg fa-handshake"></i>
          </v-tab>

          <v-tab>
            {{ $vuetify.lang.t('$vuetify.privacyPolicy') }}

            <i class="fas fa-lg fa-user-secret"></i>
          </v-tab>
        </v-tabs>
      </v-card-title>

      <v-card-text style="height: 75%">
        <v-tabs-items v-model="currentTab">
          <v-tab-item key="0">
            <div class="rich-text w-richtext"><h1>Пользовательское соглашение</h1>
              <p>Настоящий Договор является официальным предложением (публичной офертой) компании ООО «Ботмейкер»
                (в дальнейшем «Исполнитель») для любого лица (далее – «Заказчик»), которое примет настоящее предложение, на указанных ниже условиях.</p>

              <p>Данный Договор, размещенный на доменах Исполнителя - <a href="https://botmaker.co/">https://botmaker.co</a>, <a :href="applicationDomain">{{ applicationDomain }}</a> является публичной офертой,
                которая может быть акцептована совершением действий, свидетельствующих о согласии Заказчика с Договором (регистрация в
                Системе управления услугами Исполнителя, заказ услуг Исполнителя, платеж Исполнителю или согласия Заказчика в личном кабинете в разделе «Оферта»).</p>

              <p>Данный договор применяется ко всем пользователям Услугой Исполнителя и не может быть изменен для отдельной группы или отдельных Заказчиков
                (согласно ст. 426 Гражданского Кодекса РФ). Публичный договор не требует оформления на бумаге и его последующего подписания сторонами,
                обладает юридической силой в силу совершения сторонами определенных действий указывающих на их волеизъявление вступить в договорные отношения.</p>

              <p>Фактом, подтверждающим заключение публичного договора со стороны потребителя услуг, является оформление им заявки на предоставление услуг и их последующая оплата.</p>

              <p>Публичный договор, совершенный в вышеописанном порядке, считается заключенным в простой письменной форме и соответственно не требует оформления на бумаге и
                обладает полной юридической силой.</p>

              <p>Получение доступа к личному кабинету, размещенному по адресу: <a href="https://botmaker.co/">https://botmaker.co</a>,
                является безусловным и безоговорочным принятием (акцептом) Пользователем условий Соглашения.</p>

              <p><strong>1. Термины и определения</strong></p>
              <p>1.1. Услуга – предоставление заказчику программного обеспечения в аренду, позволяющее создавать чат - ботов, а также управлять созданными чат – ботами</p>
              <p>1.2. Чат-бот — специальная автоматизированная программа, которая в автоматическом режиме может принимать, обрабатывать и отправлять сообщения, созданная Пользователем с помощью Платформы.</p>
              <p>1.3. Сайт Исполнителя – совокупность информационных ресурсов Исполнителя, доступных через сеть Интернет. Располагается по адресам: <a href="https://botmaker.co/">https://botmaker.co</a>, <a href="https://botmaker.pro/">https://botmaker.pro</a>, <a href="https://botmaker.ru/">https://botmaker.ru</a>, а также на других ресурсах, принадлежащих Исполнителю.</p>
              <p>1.4. Тарифный план – документ, принимаемый и изменяемый Исполнителем в порядке, установленном Договором, и содержащий сведения о видах услуг, оказываемых Исполнителем, о порядке их заказа и стоимости. Исполнитель вправе формировать отдельные Тарифные планы для различных категорий услуг и/или потребителей.</p>
              <p>1.5. Личный кабинет по адресу <a href="https://botmaker.co/">https://botmaker.co</a> — автоматизированная система Исполнителя, предназначенная для регистрации пользователей, заказа услуг, управления услугами. Доступ к Системе управления услугами осуществляется через сайт исполнителя.</p>
              <p>1.6. Учетный период — 1 один месяц (первым днем считается день первоначальной оплаты Услуги Заказчиком. Абонентская плата осуществляется 26 числа каждого месяца.</p>
              <p>1.7. Количество возможных к публикации чат-ботов определяются тарифными планами <a href="https://botmaker.co/">https://botmaker.co</a>, <a href="https://botmaker.pro/">https://botmaker.pro</a>, <a href="https://botmaker.ru/">https://botmaker.ru</a></p>
              <p>1.8. Пользовательская панель – сервис, позволяющий создавать чат - ботов. Располагается по адресу - https://app.botmaker.co</p>
              <p>1.9. Панель «Обучение» – набор обучающих материалов, а также инструментов юридического и маркетингового характера, предоставляемых Заказчику для помощи работы с клиентами Заказчика. Доступ к таким материалам предоставляется в рамках оказываемой Услуги на срок, действующий для предоставления Услуги по данному договору.</p>
              <p>1.10. Владелец чат-бота - физическое лицо или организация, по заказу которых или для которых было создано приложение. Владелец чат-бота является также владельцем авторских прав на контент чат-бота. Право на владение чат-ботом определяется правом на владение субъектом хозяйственной деятельности, описанным в чат-боте, а также на владение контактными данными, указанными в чат-боте. Право на владение чат-ботом определяется токенами API.</p>
              <p><strong>2. Общие положения</strong></p>
              <p>2.1.1. Исполнитель обязуется предоставить Заказчику в аренду программное обеспечение для создания чат-ботов, а также оказывать иные услуги и выполнять работы, связанные с информационно-вычислительным обслуживанием Заказчика. Заказчик обязуется оплачивать Исполнителю оказанные услуги и выполненные работы.</p>
              <p>2.1.2. Перечень услуг и работ, которые могут оказываться (выполняться) Исполнителем в рамках Договора, и их существенные характеристики публикуются на Сайте Исполнителя.</p>
              <p>2.1.3. Оказание услуг и выполнение работ осуществляется в соответствии с законодательством Российской Федерации и на условиях, изложенных настоящим Договором, обязательны для исполнения Сторонами.</p>
              <p>2.1.4. Для использования Платформы Пользователь проходит регистрацию по адресу https://app.botmaker.co</p>
              <p>2.1.5. Права на программный код Ботов принадлежат Администрации.</p>
              <p>2.2. Исчисление сроков</p>
              <p>2.2.1. Все сроки для целей Договора определяются по московскому времени. Рабочие дни определяются в соответствии с официальным календарем пятидневной рабочей недели с выходными днями в субботу и воскресенье.</p>
              <p>2.2.2. Для определения времени событий используются показания времени, хранимые Системой управления услугами.</p>
              <p><strong>3. Порядок оказания услуг</strong></p>
              <p>3.1. Общие сведения об оказании услуг</p>
              <p>3.1.1. Исполнитель обеспечивает круглосуточное предоставление услуг в соответствии с Регламентами и Тарифными планами, которые пользователь получает по запросу на электронную почту или иные средства связи, в том числе и в устной форме.</p>
              <p>3.1.2. Исполнитель размещает на Сайте Исполнителя (или доводит до сведения Заказчика иным образом) информационные и методические материалы, описывающие возможности и порядок пользования услугой. Исполнитель может дополнять сайт новыми функциями, изменять, убирать старые функции и материалы, оставляя за собой право уведомить Заказчика о вносимых изменениях.</p>
              <p>3.1.3. Исполнитель оказывает техническую поддержку по всем вопросам, касающимся работы конструктора чат-ботов. Исполнитель не предоставляет технической поддержки по работе со сторонними сервисами, даже если работа данных сервисов связана с предоставляемой Исполнителем Услугой. Техническая поддержка оказывается с 9-00 до 18-00 по московскому времени в будние дни. В выходные и праздничные дни техническая поддержка оказывается в ограниченном режиме на усмотрение Исполнителя.</p>
              <p>3.1.4. Заказ услуг и управление ими осуществляется через Личный кабинет Заказчика, а также через ресурсы <a href="https://botmaker.co/">https://botmaker.co</a>, <a href="https://botmaker.pro/">https://botmaker.pro</a>, <a href="https://botmaker.ru/">https://botmaker.ru</a>. Доступ в Личный кабинет Заказчик получает в течение 48 часов с момента оплаты заказа. Любые действия, выполненные с использованием кодов доступа/паролей Заказчика, считаются выполненными Заказчиком. Заказчик обязан сохранять конфиденциальность указанных кодов/паролей и несет все риски, вызванные использованием его кодов/паролей доступа третьими лицами.</p>
              <p>3.1.5. При обнаружении Исполнителем попыток нарушения нормального функционирования Системы управления услугами с использованием кодов доступа Заказчика Исполнитель вправе, направив уведомление Заказчику, приостановить или ограничить доступ к Системе управления услугами до устранения причин нарушения.</p>
              <p>3.1.6. Перерывы в оказании услуг для проведения профилактических работ допускаются при условии предварительного извещения Заказчика о причинах, сроках и длительности перерыва не менее чем за 3 три рабочих дня. Срок извещения может сокращаться в случаях, когда это обусловлено требованиями информационной безопасности и надежности функционирования системы предоставления услуг.</p>
              <p>3.1.7. Исполнитель вправе приостановить, а также прекратить оказание услуги, если ее использование Заказчиком сопряжено с нарушением требований, установленных данным Договором или Пользовательским Соглашением, создает угрозу причинения вреда Исполнителю или третьим лицам, нарушает требования действующего законодательства.</p>
              <p>3.1.8. В соответствии с действующим законодательством Исполнитель вправе приостанавливать оказание услуг или ограничивать их возможности, если это необходимо для обеспечения приоритета сообщений, касающихся безопасности человека, сообщений о крупных авариях, катастрофах, об эпидемиях, эпизоотиях и о стихийных бедствиях, а также сообщений, связанных с проведением неотложных мероприятий в области государственного управления, обороны страны, безопасности государства и обеспечения правопорядка.</p>
              <p>3.1.9. При исчислении сроков оказания услуг первый день предоставления услуги (возобновления оказания услуги после приостановки) считается за полные сутки.</p>
              <p>3.1.10. После завершения оказания услуги Исполнитель в течение 10 дней сохраняет информацию Заказчика и предоставляет Заказчику возможность однократного получения копии этой информации установленным Исполнителем способом.</p>
              <p>3.1.11. Исполнитель предоставляет Заказчику поддерживающие материалы. Перечень и объем этих материалов определяется Исполнителем. Исполнитель вправе добавлять, удалять и изменять объем и содержание таких материалов по своему усмотрению.</p>
              <p>3.1.12. Исполнитель предоставляет на выбор Заказчику три тарифа услуг: старт, профи, эксперт. С разной стоимостью (стоимость тарифов указана по адресу <a href="https://botmaker.pro/">https://botmaker.pro</a>). </p>
              <p>На тарифе «Бесплатно» Исполнитель предоставляет заказчику возможность разработки неограниченного количества «Демонстрационных» ботов, а также обучающие материалы.</p>
              <p>На тарифе «Старт» Исполнитель предоставляет заказчику возможность разработки 1 «Боевого» чат-бота, неограниченного количества «Демонстрационных» ботов, а также обучающие материалы.</p>
              <p>На тарифе «Стандарт» Исполнитель предоставляет заказчику возможность разработки 5 «Боевых» чат-ботов, неограниченного количества «Демонстрационных» ботов, а также обучающие материалы.</p>
              <p>На тарифе «Профи» Исполнитель предоставляет заказчику возможность разработки 20 «Боевых» чат-ботов, неограниченного количества «Демонстрационных» ботов, а также обучающие материалы.</p>
              <p>На пакете «эксперт» Исполнитель предоставляет заказчику возможность разработки неограниченного числа как «Демонстрационных», так и «Боевых» чат-ботов, а также обучающие материалы. Помимо этого, менеджер компании лично доводит Заказчика до запуска чат-бота и совершения первой продажи. Если Заказчик в течении двух месяцев с момента оплаты не совершает первую продажу чат-бота, то Исполнитель может отказать в личном ведении ввиду отсутствия заинтересованности в работе самого Заказчика. Деньги за любой из перечисленных тарифов не возвращаются. Консультации производятся в рабочее время с 10:00 до 19:00 в будние дни.</p>
              <p>3.2. Заказ услуг</p>
              <p>3.2.1. Услуги предоставляются Заказчику на основании его заявок и в соответствии с Тарифным планом, которые пользователь получает по запросу на электронную почту или иные средства связи, в том числе и в устной форме.</p>
              <p>3.2.2. Подачей заявки на оказание услуги Заказчик полностью и безоговорочно принимает на себя обязательство соблюдения норм, установленных Договором, соответствующим Тарифным планом, действующими на день начала исполнения заказа. Исполнитель имеет право в одностороннем порядке менять тарифы, уведомив об этом Заказчика за 1 один месяц до смены тарифов. Уведомление осуществляется путем размещения соответствующих тарифов по адресу: <a href="https://botmaker.pro/">https://botmaker.pro</a></p>
              <p>3.2.3. Исполнение заявки на оказание услуг начинается непосредственно после получения заявки. Заказчик вправе при формировании заявки указать срок, на который откладывается ее исполнение, если такая возможность предусмотрена Тарифом оказания услуги.</p>
              <p>3.2.4. Заказчик самостоятельно совершает все действия, необходимые для продления услуг (перерегистрации доменного имени и др.), в соответствии с Тарифным планом. Заказчик вправе предоставлять соответствующие услуги от своего имени и под своим брендом, в том числе: осуществлять самостоятельный поиск клиентов, открывать клиентам аккаунты через свой Личный кабинет, создавать клиентам чат-ботов под заказ, самому определять свою ценовую политику.</p>
              <p>3.2.5. Исполнитель вправе отказаться от выполнения услуги:</p>
              <p>- если запрошенная услуга не может быть предоставлена из-за не зависящего от Исполнителя отсутствия технической возможности;</p>
              <p>- если Заказчик ранее пользовался услугами с нарушением установленных требований, создавал угрозу причинения вреда третьим лицам, нарушал требования действующего законодательства, и к моменту подачи заявки причины нарушений не устранены;</p>
              <p>- если Заказчик имеет просроченную задолженность по оплате услуг Исполнителя.</p>
              <p>3.2.6. Для предоставления отдельных видов услуг Исполнитель вправе устанавливать особые требования (в частности, определять категории лиц, которым может быть предоставлена услуга, или требовать документального подтверждения личности Заказчика), а также устанавливать особые правила подготовки заявки. Особые требования и правила подготовки заявки устанавливаются Регламентом оказания данной услуги.</p>
              <p>3.2.7. Исполнитель вправе отказаться от выполнения заявок и/или приостановить оказание ранее заказанных услуг, если Заказчик предоставил Исполнителю недостоверные сведения. Исполнитель вправе запросить у Заказчика документального подтверждения предоставленных сведений, направив соответствующий запрос по указанному Заказчиком в Системе управления услугами адресу электронной почты. При невыполнении запроса в 15-дневный срок Исполнитель вправе приостановить оказание услуг Заказчику.</p>
              <p>3.2.8. Исполнитель вправе предоставлять отдельные услуги без взимания дополнительной платы (тестовые и свободно предоставляемые услуги, в том числе предоставление готовых рекламных материалов). Такие услуги предоставляются как есть, без каких-либо гарантий со стороны Исполнителя. Исполнитель вправе отказывать в предоставлении этих услуг Заказчику без объяснения причин.</p>
              <p>3.2.9. Исполнитель вправе предлагать Заказчику услуги, оказываемые третьими лицами – поставщиками услуг. Предоставление таких услуг осуществляется в соответствии с Тарифными планами, размещенными на сайтах поставщиков услуг. Подачей заявки на оказание услуги Заказчик полностью и безоговорочно принимает на себя обязательство соблюдения норм, установленных Договором, Тарифным планом, действующими на день начала исполнения заказа.</p>
              <p>3.3. Управление услугой</p>
              <p>3.3.1. Заказчик может изменять отдельные параметры предоставляемой услуги (в т.ч. заказывать дополнительные ресурсы), менять Тарифный план. При этом Тарифным планом определяется, включены ли такие изменения параметров в состав основной услуги, или они являются дополнительными услугами, оказываемыми за отдельную плату.</p>
              <p>3.3.2. Заказчик вправе использовать любое разумное количество ресурсов в соответствии с назначением услуги, при условии, что это не препятствует нормальному использованию услуг другими пользователями.</p>
              <p><strong>4. Расчеты</strong></p>
              <p>4.1. Оплата Услуг производится Заказчиком в порядке предварительной оплаты в размере 100% суммы Услуг.</p>
              <p>4.1.1. Учет поступлений денежных средств от Заказчика и их списания при оказании услуг осуществляется в российских рублях.</p>
              <p>4.1.2. Оплата абонентской платы производится путем ежемесячного платежа и составляет 4000 рублей. Каждый разработанный чат-бот на платформе <a href="https://www.botmaker.pro/agreement#">https://botmaker.co</a> должен сопровождаться договором клиента заказчика и самого Заказчика. Оплата стоимости отдельных услуг, не входящих в состав выбранного Тарифа, производится Заказчиком по специальному счету Исполнителя.</p>
              <p>4.1.3 Сумма оплаченных услуг возврату не подлежит.</p>
              <p>4.2. Платежи</p>
              <p>4.2.1. Услуги оказываются на основании предварительной оплаты, если иное не предусмотрено Тарифным планом.</p>
              <p>4.2.2. Исполнитель принимает платежи в форме безналичных перечислений в российских рублях на банковский счет Исполнителя, реквизиты которого указаны на Сайте Исполнителя. Исполнитель вправе принимать платежи в иной форме. Выполнением платежа в соответствующей форме Заказчик соглашается с этими правилами в той редакции, которая действует на момент совершения платежа. Правила, в частности, могут устанавливать необходимость оформления дополнительных документов для выполнения платежей, определять сроки зачисления платежей и т.д.</p>
              <p>4.2.3. В случае выбора Заказчиком для оплаты услуг платежной системы, устанавливающей дополнительную комиссию к стоимости услуги Исполнителя, Исполнитель вправе переложить уплату такой комиссии на Заказчика, указав при этом итоговую стоимость на этапе оплаты и списания средств. Перечисление данной суммы Заказчиком является его согласием на оплату услуги в указанном размере.</p>
              <p>4.2.4. Возможные способы оплаты и реквизиты для оплаты указаны на Сайте Исполнителя. Формирование счетов производится по запросу Заказчика.</p>
              <p>4.3. Порядок списания платы за услуги</p>
              <p>4.3.1. Цены услуг определяются соответствующим Тарифным планом и Продуктом. Цена услуги состоит из фиксированной абонентской платы и платой за подключения к платформе <a href="https://botmaker.co/">https://botmaker.co</a>.</p>
              <p>4.3.2. Заказчик обязан обеспечить наличие средств на соответствующем услуге расчетном счете к установленному сроку списания платы (сроку платежа) или произвести оплату самому в установленный срок по реквизитам Исполнителя.</p>
              <p>4.3.3. Исполнитель вправе, но не обязан, после наступления срока платежа приостановить оказание услуги (или отложить начало оказания услуги) при недостаточности средств на соответствующем услуге расчетном счете. Срок, после которого Исполнитель может приостановить оказание Услуги при просрочке ее оплаты, определяется Исполнителем. Если начало оказания услуги откладывается из-за недостаточности средств более чем на один месяц, заявка на оказание услуги аннулируется. Услуга, оказание которой приостановлено из-за недостаточности средств более чем на один месяц, считается прекращенной по инициативе Заказчика.</p>
              <p>4.3.4. Плата за услугу списывается на основании заявки Заказчика на ее оказание или продление. Особенности формирования заявок описаны в Регламентах соответствующих услуг. Заявки на оказание и продление услуг начинают обрабатываться в дату и время их исполнения, заявки с одинаковым сроком исполнения обрабатываются в порядке их поступления. При недостатке денежных средств, необходимых для оплаты указанной в заявке услуги, заявка откладывается до поступления денежных средств, и производится обработка следующей заявки.</p>
              <p>4.3.5. Доступ к Личному кабинету, поддерживающим и обучающим материалам предоставляется в рамках действующей Услуги. В случае прекращения предоставления Услуги Заказчику по данному договору, доступ к Личному кабинету Заказчика, а также к обучающим и поддерживающим материалам аннулируется.</p>
              <p>4.3.6. В случае прекращения предоставления Услуги Заказчику все уже действующие чат-боты, находящиеся на аккаунте Заказчика блокируются Исполнителем.</p>
              <p>4.3.7. В случае прекращения предоставления Услуги Заказчику Исполнитель оставляет за собой право по истечении 15 дней с момента прекращения сотрудничества удалить Административную панель Заказчика без возможности ее последующего восстановления. Также по истечении 60 дней с момента прекращения сотрудничества Исполнитель оставляет за собой право удалить чат-ботов, созданных Заказчиком и не переданных на обслуживание согласно п. 7.8. настоящего договора без возможности их восстановления.</p>
              <p>4.4. Оформление документов</p>
              <p>4.4.1. Услуги считаются оказанными в том учетном периоде, в котором завершилось фактическое предоставление услуги.</p>
              <p>4.4.2. Для длящихся услуг, оказываемых непрерывно на протяжении нескольких учетных периодов, по заявке Заказчика для целей документооборота возможно установление промежуточных дат оказания услуги последний день каждого учетного периода, в котором услуга оказывалась. Абонентская плата за учетный период определяется как доля абонентской платы, пропорциональная отношению длительности оказания услуги в учетном периоде к общей длительности услуги.</p>
              <p>4.4.3. По требованию Заказчика в последний день учетного периода Исполнитель составляет акт об оказании услуг и в течение пяти дней направляет Заказчику по электронной почте данный акт. Заказчик вправе в течение пяти дней с момента получения акта заявить свои возражения по нему. В противном случае акт считается одобренным.</p>
              <p>4.4.4. Для оформления актов и счетов-фактур учет стоимости оказанных услуг производится в рублях.</p>
              <p><strong>5. Порядок разрешения споров и ответственность сторон</strong></p>
              <p>5.1. При возникновении споров по Договору стороны предпринимают меры, направленные на урегулирование спора путем переговоров.</p>
              <p>5.2. В случае, если спор не был урегулирован в ходе переговоров, он передается на разрешение в суд (арбитражный суд) по месту нахождения Исполнителя, если иное не установлено действующим законодательством. Сторона, обращающаяся в суд (арбитражный суд), должна до подачи иска направить претензию в письменной форме другой стороне. Срок рассмотрения претензии составляет 30 дней, если иное не установлено действующим законодательством Российской Федерации.</p>
              <p>5.3. Если иное не установлено действующим законодательством Российской Федерации, ответственность стороны за ненадлежащее исполнение обязательств по Договору ограничивается размерами прямого реального ущерба, причиненного другой стороне; при этом ответственность Исполнителя не может превышать стоимости услуги в соответствии с действующим на момент заказа услуги Тарифным планом.</p>
              <p>5.4. Услуги предоставляются по принципу «как есть» и Исполнитель не гарантирует, что все ее функциональные возможности будут отвечать ожиданиям Заказчика и смогут быть применимы для конкретной его цели.</p>
              <p>5.5. Исполнитель не несет ответственности за нарушение прав третьих лиц, возникших в результате действий Заказчика, совершенных с использованием предоставляемых Исполнителем услуг.</p>
              <p>5.6. Исполнитель, принимая меры к обеспечению качества и непрерывности оказания услуг, тем не менее, не может гарантировать отсутствие ошибок в программном обеспечении, используемом для оказания услуг, его абсолютную защищенность от компьютерных вирусов и т.д.</p>
              <p>5.7. Исполнитель не несет ответственность за сбои в телекоммуникационных сетях, не находящихся под контролем Исполнителя.</p>
              <p>5.8. Исполнитель не несет ответственность за содержание чат-ботов, опубликованных Заказчиком и/или его клиентами, но если такие приложения нарушают чьи-либо права, то Исполнитель оставляем за собой право аннулировать аккаунт Заказчика, разместившего данное приложение.</p>
              <p>5.9. Любые услуги, предоставляемые Заказчику Исполнителем, связаны с функционированием Сети Интернет, как на технических ресурсах Исполнителя, так и за их пределами, а также функционированием программного обеспечения третьих лиц, без которого оказание Услуги не имеет смысла (ресурсы компаний Facebook, Telegram и Вконтакте). Исполнитель не несет ответственности за изменение свойств, функций и качества услуг, предоставляемых Заказчику, если таковые явно не описаны в Договоре, так как данные изменения могут диктоваться требованиями компаний Facebook и Telegram, Вконтакте и не зависеть от желаний и возможностей Исполнителя и Заказчика.</p>
              <p>5.10. Исполнитель не несет ответственности за качество линий связи, если их организуют другие организации.</p>
              <p>5.11. Если при использовании Услуги будут обнаружены ошибки, Исполнитель предпримет меры для их исправления в максимально короткие сроки. Стороны соглашаются, что точное определение срока устранения ошибки не может быть установлено, так как программное обеспечение тесно взаимодействует с другими программами для ЭВМ сторонних разработчиков, операционными системами и аппаратными ресурсами компьютера Заказчика, работоспособность и время устранения проблем в полной мере не зависят только от Исполнителя.</p>
              <p>5.12. Исполнитель не несет ответственности перед Заказчиком за задержки, перебои в работе и невозможность полноценного использования собственных ресурсов Исполнителя, происходящие прямо или косвенно по причине действия или бездействия третьих лиц и/или неработоспособностью транспортно-информационных каналов, находящихся за пределами собственных ресурсов Исполнителя.</p>
              <p>5.13. Заказчик обязуется использовать предоставленные ему поддерживающие материалы только для ведения собственного бизнеса по продаже чат-ботов конечному потребителю. Заказчик не имеет права передавать, продавать и распространять любым другим способом полученные поддерживающие материалы третьим лицам, если это не оговорено Исполнителем особо. За передачу и распространение поддерживающих материалов без согласия Исполнителя, действия Заказчика считаются нарушением авторских прав Исполнителя.</p>
              <p>5.14. Заказчик принимает на себя риск неполучения прибыли и риск возможных убытков, связанных с пользованием Услуги. Исполнитель не несет ответственности за неполучение прибыли (дохода), получение прибыли (дохода) ниже ожиданий Заказчика, а также за прямые и косвенные убытки Заказчика, если это не связано непосредственно с предоставлением Услуги (возмещение убытков Заказчику Исполнителем ограничивается суммой реального документально подтвержденного ущерба).</p>
              <p>5.15. Заказчик понимает и принимает, что историческая доходность (размеры доходов, полученных другими пользователями Услуги) не подразумевает аналогичной доходности для Заказчика. Несоответствие исторической доходности настоящему размеру доходов Заказчика не является критерием некачественного оказания Услуг Исполнителем.</p>
              <p>5.16. Заказчик понимает, что любое распространение заведомо ложной и порочащей репутацию Исполнителя информации, если она не связана непосредственно с качеством предоставляемой Услуги (программного обеспечения для создания чат-ботов), является нарушением законодательства РФ и может повлечь за собой судебное преследование со стороны Исполнителя.</p>
              <p><strong>6. Срок действия и порядок изменения и расторжения Договора</strong></p>
              <p>6.1. Договор вступает в силу с момента заключения и действует неопределенный срок.</p>
              <p>6.2. Заказчик вправе расторгнуть Договор в любое время, если не имеет задолженностей перед Исполнителем.</p>
              <p>6.3. Тарифные планы могут изменяться Исполнителем в одностороннем порядке. На услуги, за которые уже списаны средства, или оказание которых начато, изменение тарифных планов не касаются.</p>
              <p>6.4. Исполнитель вправе внести изменения в типовую форму Договора об оказании услуг в любое время. Измененный договор вступает в силу в течение 7 дней с момента его публикации на сайте Исполнителя.</p>
              <p>6.5. Изменения типовой формы Договора считаются одобренными Заказчиком, а Договор считается перезаключенным по новой форме, если Заказчик до введения новой формы Договора в действие не прислал письменное уведомление о своем несогласии с новой формой Договора. В случае несогласия с изменениями Заказчик уведомляет об этом Исполнителя до введения новой формы Договора в действие. Получив уведомление о несогласии, Исполнитель с момента введения новой формы Договора в действие прекращает прием заявок от Заказчика на предоставление услуг.</p>
              <p>6.6. В случае прекращения предпринимательской деятельности Заказчика или в случае неуплаты абонентской платы, Исполнитель оставляет за собой право продолжить обслуживание действующих клиентов Заказчика (владельцев чат-ботов) на вновь определенных Исполнителем условиях. Данная передача клиентов и их приложений происходит по письменному заявлению Заказчика. В случае, если при прекращении сотрудничества Заказчик не оставил распоряжений относительно обслуживаемых им приложений, Исполнитель имеет право принять такие приложения на обслуживание по заявлению владельца приложения.</p>
              <p><strong>7. Оплата по данной Оферте и ее подтверждение означает согласие со всеми условиями (пунктами) перечисленными выше.</strong></p>
              <p>Дата публикации: 02.07.2020 г.</p></div>
          </v-tab-item>

          <v-tab-item key="1">
            <div class="rich-text w-richtext">
              <h1>Политика конфиденциальности</h1>
              <p>ООО «Ботмейкер» (далее – Компания) Политика конфиденциальности персональной информации (далее — Политика)
                действует в отношении всей информации, которую Компания и/или ее аффилированные лица, включая все лица,
                входящие в одну группу с ООО "Ботмейкер" (далее — Компания), могут получить о Пользователе во время
                использования им любого из сайтов, сервисов, служб, программ, продуктов или услуг Компании (далее —
                Сервисы) и в ходе исполнения Компанией любых соглашений и договоров с Пользователем. Согласие
                Пользователя с Политикой, выраженное им в рамках отношений с одним из перечисленных лиц,
                распространяется на все остальные перечисленные лица. Использование Сервисов Компании означает
                безоговорочное согласие Пользователя с настоящей Политикой и указанными в ней условиями обработки его
                персональной информации; в случае несогласия с этими условиями Пользователь должен воздержаться от
                использования Сервисов.</p>
              <p>1. ПЕРСОНАЛЬНАЯ ИНФОРМАЦИЯ ПОЛЬЗОВАТЕЛЕЙ, КОТОРУЮ ОБРАБАТЫВАЕТ КОМПАНИЯ</p>
              <p>1.1. В рамках настоящей Политики под «персональной информацией Пользователя» понимаются:</p>
              <p>1.1.1. Персональная информация, которую Пользователь предоставляет о себе самостоятельно при регистрации
                (создании учётной записи) или в процессе использования Сервисов, включая персональные данные
                Пользователя. Обязательная для предоставления Сервисов информация помечена специальным образом. Иная
                информация предоставляется Пользователем на его усмотрение.</p>
              <p>1.1.2. Данные, которые автоматически передаются Сервисам Компании в процессе их использования с помощью
                установленного на устройстве Пользователя программного обеспечения, в том числе IP-адрес, данные файлов
                cookie, информация о браузере Пользователя (или иной программе, с помощью которой осуществляется доступ
                к Сервисам), технические характеристики оборудования и программного обеспечения, используемых
                Пользователем, дата и время доступа к Сервисам, адреса запрашиваемых страниц и иная подобная
                информация.</p>
              <p>1.1.3. Иная информация о Пользователе, обработка которой предусмотрена условиями использования отдельных
                Сервисов Компании.</p>
              <p>1.2. Настоящая Политика применима только к информации, обрабатываемой в ходе использования Сервисов
                Компании. Компания не контролирует и не несет ответственность за обработку информации сайтами третьих
                лиц, на которые Пользователь может перейти по ссылкам, доступным на сайтах Компании.</p>
              <p>1.3. Компания не проверяет достоверность персональной информации, предоставляемой Пользователем, и не
                имеет возможности оценивать его дееспособность. Однако Компания исходит из того, что пользователь
                предоставляет достоверную и достаточную персональную информацию и поддерживает эту информацию в
                актуальном состоянии.</p>
              <p>2. ЦЕЛИ ОБРАБОТКИ ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ ПОЛЬЗОВАТЕЛЕЙ</p>
              <p>2.1. Компания собирает и хранит только ту персональную информацию, которая необходима для предоставления
                Сервисов или исполнения соглашений и договоров с Пользователем, за исключением случаев, когда
                законодательством предусмотрено обязательное хранение персональной информации в течение определенного
                законом срока.</p>
              <p>2.2. Персональную информацию Пользователя Компании обрабатывает в следующих целях:</p>
              <p>2.2.1. Идентификация стороны в рамках Сервисов, соглашений и договоров с Компанией;</p>
              <p>2.2.2. Предоставление Пользователю персонализированных Сервисов и исполнение соглашений и договоров;</p>
              <p>2.2.3. Связь с Пользователем, в том числе направление уведомлений, запросов и информации, касающихся
                использования Сервисов, исполнения соглашений и договоров, а также обработка запросов и заявок от
                Пользователя;</p>
              <p>2.2.4. Улучшение качества Сервисов, удобства их использования, разработка новых Сервисов;</p>
              <p>2.2.5. Таргетирование рекламных материалов;</p>
              <p>2.2.6. Проведение статистических и иных исследований на основе обезличенных данных. </p>
              <p>3. УСЛОВИЯ ОБРАБОТКИ ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ ПОЛЬЗОВАТЕЛЕЙ И ЕЁ ПЕРЕДАЧИ ТРЕТЬИМ ЛИЦАМ</p>
              <p>3.1. Компания хранит персональную информацию Пользователей в соответствии с внутренними регламентами
                конкретных сервисов.</p>
              <p>3.2. В отношении персональной информации Пользователя сохраняется ее конфиденциальность, кроме случаев
                добровольного предоставления Пользователем информации о себе для общего доступа неограниченному кругу
                лиц. При использовании отдельных Сервисов, Пользователь соглашается с тем, что определённая часть его
                персональной информации становится общедоступной.</p>
              <p>3.3. Компания вправе передать персональную информацию Пользователя третьим лицам в следующих случаях:</p>
              <p>3.3.1. Пользователь выразил согласие на такие действия;</p>
              <p>3.3.2. Передача необходима для использования Пользователем определенного Сервиса либо для исполнения
                определенного соглашения или договора с Пользователем;</p>
              <p>3.3.3. Передача предусмотрена российским или иным применимым законодательством в рамках установленной
                законодательством процедуры;</p>
              <p>3.3.4. Такая передача происходит в рамках продажи или иной передачи бизнеса (полностью или в части), при
                этом к приобретателю переходят все обязательства по соблюдению условий настоящей Политики применительно
                к полученной им персональной информации;</p>
              <p>3.3.5. В целях обеспечения возможности защиты прав и законных интересов Компании или третьих лиц в
                случаях, когда Пользователь нарушает настоящую Политику, либо документы, содержащие условия
                использования конкретных Сервисов.</p>
              <p>3.3.6. В результате обработки персональной информации Пользователя путем ее обезличивания получены
                обезличенные статистические данные, которые передаются третьему лицу для проведения исследований,
                выполнения работ или оказания услуг по поручению Компании.</p>
              <p>3.4. При обработке персональных данных Пользователей Компания руководствуется Федеральным законом РФ «О
                персональных данных».</p>
              <p>4. ОБРАБОТКА ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ ПРИ ПОМОЩИ ФАЙЛОВ COOKIE И СЧЕТЧИКОВ</p>
              <p>4.1. Файлы cookie, передаваемые Компанией оборудованию Пользователя и оборудованием Пользователя
                Компании, могут использоваться Компанией для предоставления Пользователю персонализированных Сервисов,
                для таргетирования рекламы, которая показывается Пользователю, в статистических и исследовательских
                целях, а также для улучшения Сервисов Компании.</p>
              <p>4.2. Пользователь осознает, что оборудование и программное обеспечение, используемые им для посещения
                сайтов в сети интернет могут обладать функцией запрещения операций с файлами cookie (для любых сайтов
                или для определенных сайтов), а также удаления ранее полученных файлов cookie.</p>
              <p>4.3. Компания вправе установить, что предоставление определенного Сервиса возможно лишь при условии, что
                прием и получение файлов cookie разрешены Пользователем.</p>
              <p>4.4. Структура файла cookie, его содержание и технические параметры определяются Компанией и могут
                изменяться без предварительного уведомления Пользователя.</p>
              <p>4.5. Счетчики, размещенные Компанией в Сервисах, могут использоваться для анализа файлов cookie
                Пользователя, для сбора и обработки статистической информации об использовании Сервисов, а также для
                обеспечения работоспособности Сервисов в целом или их отдельных функций в частности. Технические
                параметры работы счетчиков определяются Компанией и могут изменяться без предварительного уведомления
                Пользователя.</p>
              <p>5. МЕРЫ, ПРИМЕНЯЕМЫЕ ДЛЯ ЗАЩИТЫ ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ ПОЛЬЗОВАТЕЛЯ</p>
              <p>5.1. Компания принимает необходимые и достаточные организационные и технические меры для защиты
                персональной информации Пользователя от неправомерного или случайного доступа, уничтожения, изменения,
                блокирования, копирования, распространения, а также от иных неправомерных действий с ней третьих
                лиц.</p>
              <p>6. ИЗМЕНЕНИЕ ПОЛИТИКИ КОНФИДЕНЦИАЛЬНОСТИ. ПРИМЕНИМОЕ ЗАКОНОДАТЕЛЬСТВО</p>
              <p>6.1. Компания оставляет за собой право вносить изменения в настоящую Политику конфиденциальности. При
                внесении изменений в актуальной редакции указывается дата последнего обновления. Новая редакция Политики
                вступает в силу с момента ее размещения, если иное не предусмотрено новой редакцией Политики.
                Действующая редакция постоянно доступна на странице по адресу <a href="https://botmaker.ru/policy">https://botmaker.ru/policy</a>,
                <a href="https://botmaker.ru/policy">https://botmaker.ru/policy</a>.</p>
              <p>6.2. К настоящей Политике и отношениям между Пользователем и Компанией, возникающим в связи с применением
                Политики конфиденциальности, подлежит применению право Российской Федерации.</p>
              <p>7. ОБРАТНАЯ СВЯЗЬ. ВОПРОСЫ И ПРЕДЛОЖЕНИЯ</p>
              <p>7.1. Все предложения или вопросы по поводу настоящей Политики Пользователь вправе направлять в Службу
                поддержки пользователей Компании (<a href="https://botmaker.ru/">https://botmaker.ru/</a>).</p>
              <p>Дата публикации: 22.05.2020 г.</p></div>
          </v-tab-item>
        </v-tabs-items>
      </v-card-text>

      <v-divider/>

      <v-card-actions>
        <v-row class="d-flex justify-center">
          <v-col cols="3">
            <v-btn
              @click="isVisible = !isVisible"
              color="error"
              outlined
              block
            >
              Close
            </v-btn>
          </v-col>
        </v-row>
      </v-card-actions>
    </v-card>
  </v-dialog>
</template>

<script>
  export default {
    name: 'TermsAndPrivacyPolicyDialog',
    data() {
      return {
        isVisible: true,
        currentTab: ''
      }
    },
    computed: {
      applicationDomain() {
        return process.env.VUE_APP_URL.replace('app.', '');
      }
    },
    watch: {
      'isVisible'(newVal, oldVal) {
        if (!newVal && newVal !== oldVal) {
          this.$eventHub.$emit('handle-terms-and-privacy')
        }
      }
    }
  }
</script>
